In [3]:
import pandas as pd 
import numpy as np  
import matplotlib.pyplot as plt  
pd.set_option('max_columns',50)  
%matplotlib inline

# Working with DataFrames


Now that we can get data into a DataFrame, we can finally start working with them. pandas has an abundance of functionality, far too much for me to cover in this introduction. I'd encourage anyone interested in diving deeper into the library to check out its excellent documentation. Or just use Google - there are a lot of Stack Overflow questions and blog posts covering specifics of the library.

We'll be using the MovieLens dataset in many examples going forward. The dataset contains 100,000 ratings made by 943 users on 1,682 movies.

In [6]:
# pass in column names for each csv  
u_cols = ['user_id','age','sex','occupation','zip_code']  
users = pd.read_csv('ml-100K/u.user',sep='|',names=u_cols,encoding='latin-1')  

r_cols = ['user_id','movie_id','rating','unix_timestamp']  
ratings = pd.read_csv('./data/ml-100k/u.data',sep='\t',names=r_cols,encoding='latin-1')  

# the movies file contains columns indicating the movie's genres  
# let's only load the first five columns of the file with usecols  

m_cols = ['movie_id','title','release_date','video_release_date','imdb_url']   
movies = pd.read_csv('./data/ml-100k/u.item',sep='|',names=m_cols,usecols=range(5),encoding ='latin-1')

# Inspection   

pandas has a variety of functions for getting basic information about your DataFrame, the most basic of which is using the info method.

In [7]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 5 columns):
movie_id              1682 non-null int64
title                 1682 non-null object
release_date          1681 non-null object
video_release_date    0 non-null float64
imdb_url              1679 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 65.8+ KB

The output tells a few things about our DataFrame.

1. It's obviously an instance of a DataFrame.  
2. Each row was assigned an index of 0 to N-1, where N is the number of rows in the DataFrame. pandas will do this by default if an index is not specified. Don't worry, this can be changed later.  
3. There are 1,682 rows (every row must have an index).  
4. Our dataset has five total columns, one of which isn't populated at all (video_release_date) and two that are missing some values (release_date and imdb_url).  
5. The last datatypes of each column, but not necessarily in the corresponding order to the listed columns. You should use the dtypes method to get the datatype for each column.  
6. An approximate amount of RAM used to hold the DataFrame. See the .memory_usage method

In [9]:
users.dtypes

user_id        int64
age            int64
sex           object
occupation    object
zip_code      object
dtype: object

DataFrame's also have a `describe` method, **which is great for seeing basic statistics about the dataset's numeric columns**. Be careful though, since this will return information on all columns of a numeric datatype.

In [10]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

Notice user_id was included since it's numeric. Since this is an ID value, the stats for it don't really matter.

We can quickly see the average age of our users is just above 34 years old, with the youngest being 7 and the oldest being 73. The median age is 31, with the youngest quartile of users being 25 or younger, and the oldest quartile being at least 43.

You've probably noticed that I've used the head method regularly throughout this post - by default, head displays the first five records of the dataset, while tail displays the last five.

In [11]:
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [12]:
movies.tail(3)

,movie_id,title,release_date,video_release_date,imdb_url
1679,1680,Sliding Doors (1998),01-Jan-1998,NaN,http://us.imdb.com/Title?Sliding+Doors+(1998)
1680,1681,You So Crazy (1994),01-Jan-1994,NaN,http://us.imdb.com/M/title-exact?You%20So%20Cr...
1681,1682,Scream of Stone (Schrei aus Stein) (1991),08-Mar-1996,NaN,http://us.imdb.com/M/title-exact?Schrei%20aus%...

Alternatively , Python's regular slicing syntax works as well

In [13]:
movies[20:22]

,movie_id,title,release_date,video_release_date,imdb_url
20,21,Muppet Treasure Island (1996),16-Feb-1996,NaN,http://us.imdb.com/M/title-exact?Muppet%20Trea...
21,22,Braveheart (1995),16-Feb-1996,NaN,http://us.imdb.com/M/title-exact?Braveheart%20...

# Selecting    

You can think of a DataFrame as a group of Series that share an index (in this case the column headers). This makes it easy to select specific columns.  

Selecting a single column from the DataFrame will return a Series object.

In [14]:
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [15]:
users['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

In [16]:
print(type(users['occupation'].head()))

<class 'pandas.core.series.Series'>

To select multiple columns, simply pass a list of column names to the DataFrame, the output of which will be a DataFrame.

In [21]:
print(users[['age','zip_code']].head())  
print('\n')   
             
# can also store in a variable to use later  
columns_you_want = ['occupation','sex']  
print(users[columns_you_want].head())

   age zip_code
0   24    85711
1   53    94043
2   23    32067
3   24    43537
4   33    15213


   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

In [22]:
print(type(users[columns_you_want]))

<class 'pandas.core.frame.DataFrame'>

Row selection can be done multiple ways, but doing so by an individual index or boolean indexing are typically easiest.

In [23]:
#users older than 25  
print(users[users.age>25].head(3))  
print('\n')  

#users aged 40 and male  
print(users[(users.age==40) & (users.sex =='M')].head(3))

   user_id  age sex occupation zip_code
1        2   53   F      other    94043
4        5   33   F      other    15213
5        6   42   M  executive    98101


     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232

Since our index is kind of meaningless right now, let's set it to the user_id using the set_index method. By default, set_index returns a new DataFrame, so you'll have to specify if you'd like the changes to occur in place.  

This has confused me in the past ,so look carefully at the code and output below

In [24]:
print(users.set_index('user_id').head())
print('\n')  

print(users.head())  
print("\n^^^ I didn't actually change the DataFrame. ^^^\n")

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213


   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

^^^ I didn't actually change the DataFrame. ^^^

In [25]:
with_new_index = users.set_index('user_id')  
print(with_new_index.head())  
print("\n ^^^ set_index actually returns a new DataFrame. ^^^\n")

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

 ^^^ set_index actually returns a new DataFrame. ^^^

If you want to modify your existing DataFrame, use the inplace parameter. Most DataFrame methods return new a DataFrames, while offering an inplace parameter. Note that the inplace version might not actually be any more efficint (in terms of speed or memory usage) that the regular version.

In [26]:
users.set_index('user_id',inplace= True)  
users.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

Notice that we've lost the default pandas 0-based index and moved the user_id into its place. We can select rows by position using the iloc method.

# ** If selecting rows by label use loc **

In [36]:
print(users.loc[100])  
print('\n')  
print(users.loc[[2,51,301]])

age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object


         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

# If selecting rows by position(0 based indexing) use iloc

In [37]:
print(users.loc[100])  
print('\n')  
print(users.iloc[99])

age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object


age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object

In [38]:
print(users.iloc[[1,50,300]])

         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

If we realize later that we liked the old pandas default index, we can just reset_index. The same rules for inplace apply.

In [39]:
users.reset_index(inplace=True)  
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

The simplified rules of indexing are

- **Use loc for label-based indexing**
- **Use iloc for positional indexing**    
I've found that I can usually get by with boolean indexing, loc and iloc, but pandas has a whole host of other ways to do selection.

 # Joining  
 Throughout an analysis, we'll often need to merge/join datasets as data is typically stored in a **relational** manner.

Our MovieLens data is a good example of this - a rating requires both a user and a movie, and the datasets are linked together by a key - in this case, the user_id and movie_id. It's possible for a user to be associated with zero or many ratings and movies. Likewise, a movie can be rated zero or many times, by a number of different users.

Like SQL's JOIN clause, **pandas.merge** allows two DataFrames to be joined on one or more keys. The function provides a series of parameters **(on, left_on, right_on, left_index, right_index)** allowing you to specify the columns or indexes on which to join.  

By default, `pandas.merge` operates as an *inner join*, which can be changed using the `how` parameter.

 Below are some examples of what each look like.

In [40]:
left_frame = pd.DataFrame({'Key':range(5),'left_value':['a','b','c','d','e']})  
right_frame = pd.DataFrame({'Key':range(2,7),'right_value':['f','g','h','i','j']})  

print(left_frame)  
print('\n')  
print(right_frame)

   Key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e


   Key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

 # inner join(default)

In [42]:
pd.merge(left_frame,right_frame,on='Key',how='inner')

   Key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h

We lose values from both frames since certain keys do not match up. The SQL equivalent is:

```  
SELECT left_frame.key, left_frame.left_value, right_frame.right_value
    FROM left_frame
    INNER JOIN right_frame
        ON left_frame.key = right_frame.key

```

Had our key columns not been named the same, we could have used the left_on and right_on parameters to specify which fields to join from each frame. python     ```pd.merge(left_frame, right_frame, left_on='left_key', right_on='right_key')``` Alternatively, if our keys were indexes, we could use the left_index or right_index parameters, which accept a True/False value. You can mix and match columns and indexes like so: python     ```pd.merge(left_frame, right_frame, left_on='key', right_index=True)```

# left outer join

In [44]:
pd.merge(left_frame,right_frame,on='Key',how='left')

   Key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h

# Right outer join

In [46]:
pd.merge(left_frame,right_frame,on='Key',how='right')

   Key left_value right_value
0  2.0          c           f
1  3.0          d           g
2  4.0          e           h
3  5.0        NaN           i
4  6.0        NaN           j

# Full outer join

In [48]:
pd.merge(left_frame,right_frame,on='Key',how='outer')

   Key left_value right_value
0  0.0          a         NaN
1  1.0          b         NaN
2  2.0          c           f
3  3.0          d           g
4  4.0          e           h
5  5.0        NaN           i
6  6.0        NaN           j

# combining

pandas also provides a way to combine DataFrames along an axis - ```pandas.concat```. While the function is equivalent to SQL's UNION clause, there's a lot more that can be done with it.

```pandas.concat``` takes a list of Series or DataFrames and returns a Series or DataFrame of the concatenated objects. Note that because the function takes list, you can combine many objects at once.

In [50]:
pd.concat([left_frame,right_frame])

   Key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c         NaN
3    3          d         NaN
4    4          e         NaN
0    2        NaN           f
1    3        NaN           g
2    4        NaN           h
3    5        NaN           i
4    6        NaN           j

By default, the function will vertically append the objects to one another, combining columns with the same name. We can see above that values not matching up will be NULL.  

Additionally, objects can be concatentated side-by-side using the function's axis parameter.

In [51]:
pd.concat([left_frame,right_frame],axis=1)

   Key left_value  Key right_value
0    0          a    2           f
1    1          b    3           g
2    2          c    4           h
3    3          d    5           i
4    4          e    6           j

# Grouping

Grouping in pandas took some time for me to grasp, but it's pretty awesome once it clicks.  

pandas ```groupby``` method draws largely from the **split-apply-combine strategy for data analysis**. If you're not familiar with this methodology, I highly suggest you read up on it. It does a great job of illustrating how to properly think through a data problem, which I feel is more important than any technical skill a data analyst/scientist can possess  

When approaching a data analysis problem, you'll often break it apart into manageable pieces, perform some operations on each of the pieces, and then put everything back together again (this is the gist split-apply-combine strategy). pandas ```groupby``` is great for these problems (R users should check out the plyr and dplyr packages)

The City of Chicago is kind enough to publish all city employee salaries to its open data portal. Let's go through some basic ``groupby`` examples using this data.

In [53]:
!head -n 3 city-of-chicago-salaries.csv

'head' is not recognized as an internal or external command,
operable program or batch file.

Since the data contains a dollar sign for each salary, python will treat the field as a series of strings. We can use the ```converters``` parameter to change this when reading in the file.

In [54]:
headers = ['name','title','department','salary']  
chicago =pd.read_csv('./data/city-of-chicago-salaries.csv',header=0,names=headers,
                    converters={'salary':lambda x:float(x.replace('$',''))}) 
chicago.head()

                    name                     title        department   salary
0        AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT  85512.0
1      AARON,  JEFFERY M            POLICE OFFICER            POLICE  75372.0
2    AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES  80916.0
3    ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  99648.0
4  ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC          AVIATION  89440.0

pandas ```groupby``` returns a DataFrameGroupBy object which has a variety of methods, many of which are similar to standard SQL aggregate functions.

In [55]:
by_dept = chicago.groupby('department')  
by_dept

Calling ```count``` returns the total number of NOT NULL values within each column. If we were interested in the total number of records in each group, we could use ```size```

In [56]:
print(by_dept.count().head()) # NOT NULL records within each column  
print('\n')  
print(by_dept.size().tail()) # total records for each department

                   name  title  salary
department
ADMIN HEARNG         42     42      42
ANIMAL CONTRL        61     61      61
AVIATION           1218   1218    1218
BOARD OF ELECTION   110    110     110
BOARD OF ETHICS       9      9       9


department
PUBLIC LIBRARY     926
STREETS & SAN     2070
TRANSPORTN        1168
TREASURER           25
WATER MGMNT       1857
dtype: int64

Summation can be done via ```sum```, averaging by ```mean```, etc. (if it's a SQL function, chances are it exists in pandas). Oh, and there's median too, something not available in most databases.

In [61]:
print(by_dept['department'].unique())

print('\n')

len(by_dept['department'].unique())

department
ADMIN HEARNG                      [ADMIN HEARNG]
ANIMAL CONTRL                    [ANIMAL CONTRL]
AVIATION                              [AVIATION]
BOARD OF ELECTION            [BOARD OF ELECTION]
BOARD OF ETHICS                [BOARD OF ETHICS]
BUDGET & MGMT                    [BUDGET & MGMT]
BUILDINGS                            [BUILDINGS]
BUSINESS AFFAIRS              [BUSINESS AFFAIRS]
CITY CLERK                          [CITY CLERK]
CITY COUNCIL                      [CITY COUNCIL]
COMMUNITY DEVELOPMENT    [COMMUNITY DEVELOPMENT]
CULTURAL AFFAIRS              [CULTURAL AFFAIRS]
DISABILITIES                      [DISABILITIES]
DoIT                                      [DoIT]
FAMILY & SUPPORT              [FAMILY & SUPPORT]
FINANCE                                [FINANCE]
FIRE                                      [FIRE]
GENERAL SERVICES              [GENERAL SERVICES]
HEALTH                                  [HEALTH]
HUMAN RELATIONS                [HUMAN RELATIONS]
HUMAN RESOURCES                [HUMAN RESOURCES]
INSPECTOR GEN                    [INSPECTOR GEN]
IPRA                                      [IPRA]
LAW                                        [LAW]
LICENSE APPL COMM            [LICENSE APPL COMM]
MAYOR'S OFFICE                  [MAYOR'S OFFICE]
OEMC                                      [OEMC]
POLICE                                  [POLICE]
POLICE BOARD                      [POLICE BOARD]
PROCUREMENT                        [PROCUREMENT]
PUBLIC LIBRARY                  [PUBLIC LIBRARY]
STREETS & SAN                    [STREETS & SAN]
TRANSPORTN                          [TRANSPORTN]
TREASURER                            [TREASURER]
WATER MGMNT                        [WATER MGMNT]
Name: department, dtype: object

35

In [63]:
print(by_dept.sum()[20:25])  #total salaries of each department  
print('\n')  
print(by_dept.mean()[20:25]) #avaerage salary of each department  
print('\n')  
print(by_dept.median()[20:25]) # take that,RDBMS!

                       salary
department
HUMAN RESOURCES     4850928.0
INSPECTOR GEN       4035150.0
IPRA                7006128.0
LAW                31883920.2
LICENSE APPL COMM     65436.0


                         salary
department
HUMAN RESOURCES    71337.176471
INSPECTOR GEN      80703.000000
IPRA               82425.035294
LAW                70853.156000
LICENSE APPL COMM  65436.000000


                    salary
department
HUMAN RESOURCES    68496.0
INSPECTOR GEN      76116.0
IPRA               82524.0
LAW                66492.0
LICENSE APPL COMM  65436.0

Operations can also be done on an individual Series within a grouped object. Say we were curious about the five departments with the most distinct titles - the pandas equivalent to:  

```
SELECT department, COUNT(DISTINCT title)
FROM chicago
GROUP BY department
ORDER BY 2 DESC
LIMIT 5;  
```  

pandas is a lot less verbose here

In [64]:
by_dept.title.nunique().sort_values(ascending=False)[:5]

department
WATER MGMNT    153
TRANSPORTN     150
POLICE         130
AVIATION       125
HEALTH         118
Name: title, dtype: int64

# split-apply-combine

The real power of groupby comes from it's split-apply-combine ability.  
What if we wanted to see the highest paid employee within each department. Given our current dataset, we'd have to do something like this in SQL:  
```
SELECT *
FROM chicago c
INNER JOIN (
    SELECT department, max(salary) max_salary
    FROM chicago
    GROUP BY department
) m
ON c.department = m.department
AND c.salary = m.max_salary; 
```  

This would give you the highest paid person in each department, but it would return multiple if there were many equally high paid people within a department.  

Alternatively, you could alter the table, add a column, and then write an update statement to populate that column. However, that's not always an option.

Using ```groupby``` we can define a function (which we'll call ```ranker```) that will label each record from 1 to N, where N is the number of employees within the department. We can then call ```apply``` to, well, _apply_ that function to each group (in this case, each department).

In [66]:
def ranker(df):  
    """Assigns a rank to each employee based on salary , with 1 being 
    the highest paid. 
      Assumes the data is DESC sorted."""  
    df['dept_rank']=np.arange(len(df)) + 1  
    return df

In [70]:
chicago.sort_values('salary',ascending=False,inplace=True)  
chicago = chicago.groupby('department').apply(ranker)  
print(chicago[chicago.dept_rank ==1][['title','salary']])

                                              title    salary
18039                      SUPERINTENDENT OF POLICE  260004.0
8004                                          MAYOR  216210.0
25588                             FIRE COMMISSIONER  202728.0
763                        COMMISSIONER OF AVIATION  186576.0
4697                         COMMISSIONER OF HEALTH  177156.0
21971                           CORPORATION COUNSEL  173664.0
12635                                    BUDGET DIR  169992.0
22894                    COMMISSIONER OF WATER MGMT  169512.0
15053                COMMISSIONER OF TRANSPORTATION  169500.0
25778                    EXEC DIR EMERG MGMT & COMM  167796.0
1416         COMMISSIONER OF CHICAGO PUBLIC LIBRARY  167004.0
23878                     CHIEF PROCUREMENT OFFICER  163656.0
8493                              INSPECTOR GENERAL  161856.0
14365                  CHIEF ADMINISTRATIVE OFFICER  160248.0
6914    COMMISSIONER OF FAMILY AND SUPPORT SERVICES  157092.0
30849        COMMISSIONER OF STREETS AND SANITATION  157092.0
18861                     COMMISSIONER OF BUILDINGS  157092.0
15401  COMMISSIONER OF BUS AFAIRS AND CONSUMER PROT  157092.0
23851   COMMISSIONER OF FLEET & FACILITY MANAGEMENT  157092.0
19470        COMMISSIONER OF HOUSING & ECONOMIC DEV  156504.0
13270                DIR OF ADMINISTRATIVE HEARINGS  156420.0
2473   COMMISSIONER OF CULTURAL AFFAIRS/SPEC EVENTS  155040.0
1983                      CHIEF INFORMATION OFFICER  154992.0
4684                COMMISSIONER OF HUMAN RESOURCES  151572.0
766                FIRST DEPUTY CHIEF ADMINISTRATOR  146940.0
14544                              FIRST DEPUTY DIR  145008.0
405        EXECUTIVE DIR OF ANIMAL CARE AND CONTROL  134124.0
28162         COMM MAYORS OFF PEOPLE W DISABILITIES  134124.0
20379                                CITY TREASURER  133545.0
18826                                    CITY CLERK  133545.0
1982                EXECUTIVE DIR - BOARD OF ETHICS  125532.0
20686   CHAIRPERSON - COMMISSION ON HUMAN RELATIONS  125004.0
1632            DEPUTY CHIEF ADMINISTRATIVE OFFICER  124320.0
3916                   EXECUTIVE DIR - POLICE BOARD   97728.0
11154                                    STAFF ASST   65436.0

In [71]:
chicago[chicago.department == "LAW"][:5]

,name,title,department,salary,dept_rank
21971,"PATTON, STEPHEN R",CORPORATION COUNSEL,LAW,173664.0,1
6311,"DARLING, LESLIE M",FIRST ASST CORPORATION COUNSEL,LAW,149160.0,2
17680,"MARTINICO, JOSEPH P",CHIEF LABOR NEGOTIATOR,LAW,144036.0,3
22357,"PETERS, LYNDA A",CITY PROSECUTOR,LAW,139932.0,4
25022,"RUETHER, MARY E",DEPUTY CORPORATION COUNSEL,LAW,137076.0,5

We can now see where each employee ranks within their department based on salary.